app/Controllers/AccesoController.php

    public function auth(){
        // Inicia la sesión
        $session = session();
        // Instancio un nuevo modelo
        $model = new UsuarioModel();
        // Traemos los datos del formulario y los guardamos en una variable
        $mail = $this->request->getVar('mail');
        $password = $this->request->getVar('pass');

        // Compara los datos de la columna mail de la BD con el $mail del input del form hasta que encuentre la primer coincidencia y lo guarda en una variable
        $data = $model->where('mail', $mail)->first();
---
SELECT *
FROM `usuarios`
WHERE `mail` = 'cristian@hotmail.com'
 LIMIT 1